#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Prod Plan 📖`success`
#### Preview URL 🌎 [https://](https://)
<details><summary>Show Prod Plan</summary>

```

module.sql.random_string.link: Refreshing state... [id=qll7kg]
module.sql.random_password.sql-password: Refreshing state... [id=none]
module.sql.random_password.sql-password-2: Refreshing state... [id=none]
module.sql.azurerm_resource_group.sql: Refreshing state... [id=/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus]
module.sql.azurerm_network_security_group.sql-nsg: Refreshing state... [id=/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.Network/networkSecurityGroups/nsg-sql-prod-eus]
module.sql.azurerm_virtual_network.link: Refreshing state... [id=/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.Network/virtualNetworks/qll7kg-network-sql-prod-eus]
module.sql.azurerm_user_assigned_identity.sql_id: Refreshing state... [id=/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sql-admin-sql-prod-eus]
module.sql.azurerm_subnet.link: Refreshing state... [id=/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.Network/virtualNetworks/qll7kg-network-sql-prod-eus/subnets/qll7kg-subnet-sql-prod-eus]
module.sql.azurerm_key_vault.vault: Refreshing state... [id=/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.KeyVault/vaults/kv-sql-prod-eus]
module.sql.azurerm_subnet_network_security_group_association.sql-nsg: Refreshing state... [id=/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.Network/virtualNetworks/qll7kg-network-sql-prod-eus/subnets/qll7kg-subnet-sql-prod-eus]
module.sql.azurerm_private_endpoint.link: Refreshing state... [id=/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.Network/privateEndpoints/qll7kg-endpoint-sql-prod-eus]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.sql.azurerm_key_vault.vault will be updated in-place
  ~ resource "azurerm_key_vault" "vault" {
      ~ access_policy                   = [
            # (1 unchanged element hidden)
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "WrapKey",
                    "UnwrapKey",
                ]
                object_id               = "42c1e48f-fba6-4f6b-ae55-f407ae24aff8"
                secret_permissions      = [
                    "Get",
                    "Set",
                    "List",
                ]
                storage_permissions     = [
                    "Get",
                    "Set",
                ]
                tenant_id               = "567e2175-bf4e-4bcc-b114-335fa0061f2f"
            },
          ~ {
              ~ object_id               = "7dfd636f-dfc0-40d9-aabc-9c38f63c0628" -> "08b5b379-4869-4b76-bc39-1904153c9b26"
                # (6 unchanged attributes hidden)
            },
        ]
        id                              = "/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.KeyVault/vaults/kv-sql-prod-eus"
        name                            = "kv-sql-prod-eus"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sql.azurerm_key_vault_key.sql will be created
  + resource "azurerm_key_vault_key" "sql" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "unwrapKey",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = "/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.KeyVault/vaults/kv-sql-prod-eus"
      + n                       = (known after apply)
      + name                    = "key-sql-prod-eus"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # module.sql.azurerm_key_vault_secret.sql-secret will be created
  + resource "azurerm_key_vault_secret" "sql-secret" {
      + expiration_date         = "2025-07-31T00:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.KeyVault/vaults/kv-sql-prod-eus"
      + name                    = "secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sql.azurerm_monitor_diagnostic_setting.logs will be created
  + resource "azurerm_monitor_diagnostic_setting" "logs" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + name                           = "ds-sql-prod-eus"
      + storage_account_id             = (known after apply)
      + target_resource_id             = "/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.KeyVault/vaults/kv-sql-prod-eus"

      + enabled_log {
          + category = "AuditEvent"

          + retention_policy {
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.sql.azurerm_mssql_database.database[0] will be created
  + resource "azurerm_mssql_database" "database" {
      + auto_pause_delay_in_minutes         = (known after apply)
      + collation                           = (known after apply)
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = (known after apply)
      + maintenance_configuration_name      = (known after apply)
      + max_size_gb                         = (known after apply)
      + min_capacity                        = (known after apply)
      + name                                = "test"
      + read_replica_count                  = (known after apply)
      + read_scale                          = (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = (known after apply)
      + sku_name                            = (known after apply)
      + storage_account_type                = "Geo"
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = (known after apply)

      + long_term_retention_policy {
          + monthly_retention = "P1M"
          + week_of_year      = (known after apply)
          + weekly_retention  = (known after apply)
          + yearly_retention  = (known after apply)
        }
    }

  # module.sql.azurerm_mssql_database.database[1] will be created
  + resource "azurerm_mssql_database" "database" {
      + auto_pause_delay_in_minutes         = (known after apply)
      + collation                           = (known after apply)
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = (known after apply)
      + maintenance_configuration_name      = (known after apply)
      + max_size_gb                         = (known after apply)
      + min_capacity                        = (known after apply)
      + name                                = "test2"
      + read_replica_count                  = (known after apply)
      + read_scale                          = (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = (known after apply)
      + sku_name                            = (known after apply)
      + storage_account_type                = "Geo"
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = (known after apply)

      + long_term_retention_policy {
          + monthly_retention = "P1M"
          + week_of_year      = (known after apply)
          + weekly_retention  = (known after apply)
          + yearly_retention  = (known after apply)
        }
    }

  # module.sql.azurerm_mssql_database.database[2] will be created
  + resource "azurerm_mssql_database" "database" {
      + auto_pause_delay_in_minutes         = (known after apply)
      + collation                           = (known after apply)
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = (known after apply)
      + maintenance_configuration_name      = (known after apply)
      + max_size_gb                         = (known after apply)
      + min_capacity                        = (known after apply)
      + name                                = "test3"
      + read_replica_count                  = (known after apply)
      + read_scale                          = (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = (known after apply)
      + sku_name                            = (known after apply)
      + storage_account_type                = "Geo"
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = (known after apply)

      + long_term_retention_policy {
          + monthly_retention = "P1M"
          + week_of_year      = (known after apply)
          + weekly_retention  = (known after apply)
          + yearly_retention  = (known after apply)
        }
    }

  # module.sql.azurerm_mssql_server.sql will be created
  + resource "azurerm_mssql_server" "sql" {
      + administrator_login                          = "OSTAdmin"
      + administrator_login_password                 = (sensitive value)
      + connection_policy                            = "Default"
      + fully_qualified_domain_name                  = (known after apply)
      + id                                           = (known after apply)
      + location                                     = "eastus"
      + minimum_tls_version                          = "1.2"
      + name                                         = "sql-sql-prod-eus"
      + outbound_network_restriction_enabled         = false
      + primary_user_assigned_identity_id            = "/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sql-admin-sql-prod-eus"
      + public_network_access_enabled                = false
      + resource_group_name                          = "rg-sql-prod-eus"
      + restorable_dropped_database_ids              = (known after apply)
      + transparent_data_encryption_key_vault_key_id = (known after apply)
      + version                                      = "12.0"

      + azuread_administrator {
          + azuread_authentication_only = false
          + login_username              = "tim.moran@ostusa.com"
          + object_id                   = "7bdd0ef2-6c8c-4483-b155-b7e1401110f8"
          + tenant_id                   = "567e2175-bf4e-4bcc-b114-335fa0061f2f"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sql-admin-sql-prod-eus",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # module.sql.azurerm_mssql_server_transparent_data_encryption.sql will be created
  + resource "azurerm_mssql_server_transparent_data_encryption" "sql" {
      + auto_rotation_enabled = false
      + id                    = (known after apply)
      + key_vault_key_id      = (known after apply)
      + server_id             = (known after apply)
    }

  # module.sql.azurerm_private_endpoint.sql_link will be created
  + resource "azurerm_private_endpoint" "sql_link" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "qll7kg-sql-endpoint-sql-prod-eus"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-sql-prod-eus"
      + subnet_id                = "/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.Network/virtualNetworks/qll7kg-network-sql-prod-eus/subnets/qll7kg-subnet-sql-prod-eus"

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "qll7kg-sql-psc-sql-prod-eus"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sqlServer",
            ]
        }
    }

  # module.sql.azurerm_private_endpoint.storage_link will be created
  + resource "azurerm_private_endpoint" "storage_link" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "qll7kg-storage-endpoint-sql-prod-eus"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-sql-prod-eus"
      + subnet_id                = "/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.Network/virtualNetworks/qll7kg-network-sql-prod-eus/subnets/qll7kg-subnet-sql-prod-eus"

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "qll7kg-storage-psg-sql-prod-eus"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "File",
            ]
        }
    }

  # module.sql.azurerm_storage_account.logs will be created
  + resource "azurerm_storage_account" "logs" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "GRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = true
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = "sasqlprodeus"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rg-sql-prod-eus"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + customer_managed_key {
          + key_vault_key_id          = (known after apply)
          + user_assigned_identity_id = "/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sql-admin-sql-prod-eus"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sql-admin-sql-prod-eus",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sql-prod-eus/providers/Microsoft.Network/virtualNetworks/qll7kg-network-sql-prod-eus/subnets/qll7kg-subnet-sql-prod-eus",
            ]
        }
    }

  # module.sql.azurerm_storage_encryption_scope.encrypt will be created
  + resource "azurerm_storage_encryption_scope" "encrypt" {
      + id                                 = (known after apply)
      + infrastructure_encryption_required = true
      + key_vault_key_id                   = (known after apply)
      + name                               = "scopesqlprodeus"
      + source                             = "Microsoft.Storage"
      + storage_account_id                 = (known after apply)
    }

Plan: 12 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
Pushed by: @christianmscottost, Action: pull_request